# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..Id Property
Category Class See Also
---
Returns the category id associated with the category object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

# See Also
Category Class
Autodesk.Revit.DB Namespace